/*
///////////////////////////////////////////////////////////////////////////////
//                             Lenix嵌入式操作系统
//                         2011 - 2014 @ 源代码工作室
//                                保留所有版权
//                     ***----------------------------***
//  名    称: char.c
//  创建时间: 2014-02-02        创建者: 罗斌
//  修改时间:                   修改者: 
//  主要功能: 提供基本的字符操作函数
//
//  说    明: 
//
//  变化记录:
//  版 本 号    |     时间      |  作  者       |  主要变化记录
//=============================================================================
//              |  2012-07-02   |  罗  斌       |  从type.h中分离
///////////////////////////////////////////////////////////////////////////////
*/


#include <type.h>
#include <lchar.h>


char        _up_case(char c)
{
    if( c >= 'a' &&  c <= 'z' )
        return c & ~0x20;
    return c;
}

char        _lw_case(char c)
{
    if( c >= 'A' && c <= 'Z' )
        return c | 0x20;
    return c;
}

int         _is_up_case(char c)
{
    if( c >= 'A' && c <= 'Z' )
        return 1;
    return 0;

}

int         _is_lw_case(char c)
{
    if( c >= 'a' &&  c <= 'z' )
        return 1;
    return 0;
}

int         _is_hex(char c)
{
    if( (c >= '0' && c <= '9') || ( c >= 'a' && c <= 'f' ) || \
        (c >= 'A' && c <= 'Z'))
        return 1;
    return 0;
}

int         _is_digital(char c)
{
    if( (c >= '0' && c <= '9') )
        return 1;
    return 0;
}

